Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_insurance_prsi/employer_job_prsi_incentive_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Employer Job (PRSI) Incentive Scheme
ga: Scéim Dreasachta Jabanna (ÁSPC) i gcomhair Fostóirí

source: The Employer Job (PRSI) Incentive Scheme exempted employers from liability to pay their share of PRSI for certain employees
ga: Díolmhaíonn an Scéim Dreasachta Jabanna (ÁSPC) i gcomhair Fostóirí fostóirí óna ndliteanas a gcion d’ÁSPC i leith fostaithe áirithe a íoc

source: The scheme was open to employers who create new and additional jobs
ga: Tá an scéim seo oscailte d’fhostóirí a chruthaíonn jabanna nua agus jabanna breise

source: The Employer Job (PRSI) Incentive Scheme ceased on 30 June 2013 for new participants
ga: An 30 Meitheamh 2013 cuireadh deireadh an Scéim Dreasachta Jabanna (ÁSPC)

source: A new JobsPlus incentive scheme has replaced the Employer Job (PRSI) Exemption Scheme and Revenue Job Assist from July 2013
ga: Ó 8 Iúil 2013 cuireadh scéim dreasachta nua JobsPlus in áit na Postchúnamh Ioncaim agus Scéime Dreasachta Jabanna (ÁSPC) i gcomhair Fostóirí

source: Existing participants on the Revenue Job Assist and Employer Job (PRSI) Exemption Scheme (which both ceased for new participants on 30 June 2013) are not affected by the new JobsPlus scheme
ga: Ní bhainfidh an scéim nua JobsPlus le rannpháirtithe reatha ar an Scéim Dreasachta Jabanna (ÁSPC)

source: To qualify for the Employer Job (PRSI) Incentive Scheme both the job you create and the person you employ must meet certain criteria
ga: Chun cáiliú don Scéim Dreasacht Jabanna (ÁSPC) i gcomhair Fostóirí, ní mór don jab a chruthaíonn tú agus don duine a fhostaíonn tú critéir áirithe a chomhlíonadh

source: While you are waiting to be approved for the scheme, you should operate the standard employee and employer PRSI
ga: Chomh fada is atá tú ag fanacht ar fhaomhadh don scéim, ba chóir duit ÁSPC fostaí agus fostóra caighdeánach a fheidhmiú

source: The person you employ must have been getting one of the following social welfare payments for a period of at least 6 months (156 days):
ga: Ní mór don duine a fhostaíonn tú a bheith ag fáil ceann de na híocaíochtaí leasa shóisialaigh seo a leanas ar feadh tréimhse leanúnach 6 mhí ar a laghad:

source: You can also employ an eligible person directly from JobBridge or the Work Placement Programme once the required 156 days criteria has been satisfied
ga: Is féidir leat a fhostú ar dhuine cáilithe díreach as ceann de na scéimeanna seo nuair atá critéir 156 lá (6 mhí) sásaithe

source: • Be a new and additional post/job – employers are not allowed to substitute existing employees to avail of the scheme
ga: • A bheith ina phost/jab nua agus breise - ní cheadófar d’fhostóirí fostaithe nua a fháil in áit fostaithe reatha chun leas a bhaint as an scéim

source: • Be for at least 30 hours per week
ga: • A bheith ar feadh 30 uaire in aghaidh na seachtaine ar a laghad

source: • Last for at least 6 months
ga: • Seasamh ar feadh 6 mhí ar a laghad

source: If the employment ends within 6 months of getting the exemption, you may be liable to pay the employer’s PRSI contributions for that employee
ga: Má thagann deireadh leis an bhfostaíocht taobh istigh de 6 mhí ón am a fhaigheann tú an díolúine, d’fhéadfadh go mbeadh ort ranníocaíochtaí ÁSPC an fhostóra a íoc i leith an fhostaí sin

source: You can only get an exemption from employer’s PRSI for a limited number of employees
ga: Ní féidir leat díolúine a fháil ó ÁSPC ach amháin i leith líon teoranta fostaithe

source: This limit is 5% of your existing workforce or, for smaller companies, a maximum of 5 new jobs
ga: Is é an teorainn seo ná 5% den fhoireann oibre reatha, nó, i gcás cuideachtaí níos lú, uasmhéid de 5 phost nua

source: If you have a new employee and are eligible for the scheme, you should fill in a PRSI 20 form
ga: Má tá fostaí nua agat agus go bhfuil tú incháilithe don scéim, líon isteach foirm ÁSPC 20

source: Send the PRSI 20 form with a current tax clearance certificate to the Department of Social Protection – see ‘Where to apply’ below
ga: Seol an fhoirm ÁSPC 20 le deimhniú imréiteach cánach reatha chuig an Roinn Coimirce Sóisialaí - féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos
